import { z } from 'zod';

export const userInfoSchema = z.object({
  name: z
    .string()
    .trim()
    .min(3, 'نام و نام خانوادگی باید حداقل ۳ کاراکتر باشد')
    .max(100, 'نام و نام خانوادگی نمی‌تواند بیشتر از ۱۰۰ کاراکتر باشد')
    .regex(
      /^[\u0600-\u06FFa-zA-Z]+(?:\s+[\u0600-\u06FFa-zA-Z]+)+$/,
      'نام و نام خانوادگی را به صورت صحیح وارد کنید'
    ),

  email: z
    .string()
    .trim()
    .toLowerCase()
    .min(1, 'ایمیل الزامی است')
    .email('ایمیل وارد شده معتبر نیست')
    .max(254, 'ایمیل نمی‌تواند بیشتر از ۲۵۴ کاراکتر باشد'),
});
